#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS-MANAGEMENT.keycloak_group.GROUP has changed
  ~ resource "keycloak_group" "GROUP" {
      + attributes = {}
        id         = "316e482e-57a5-4383-a559-5781b0dbac80"
        name       = "Health-IDEAS Management"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS.module.client-roles.keycloak_role.ROLES["REPORTS_ADMIN_DEV"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "22020243-a37e-4d46-af4f-1d4e38a9d45e"
        name       = "REPORTS_ADMIN_DEV"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS.module.client-roles.keycloak_role.ROLES["REPORTS_ADMIN_UAT"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "7db7d180-c253-4073-991e-9a023f59feb0"
        name       = "REPORTS_ADMIN_UAT"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-health-ideas"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "d40ab7e9-2b7e-4cc8-887c-e04892b30032"
        name       = "view-client-health-ideas"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.PANORAMA.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PANORAMA"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "An eHealth system that allows authorized public health care providers to document and securely store all public health services and care programs in BC and Yukon."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "Panorama"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "*",
        ]
      + web_origins                               = [
          + "",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PANORAMA.keycloak_openid_user_session_note_protocol_mapper.identity_provider will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "identity_provider" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "identity_provider"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "identity_provider"
      + realm_id            = "moh_applications"
      + session_note        = "identity_provider"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*